<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"1b7320215325266cf87784c195207f63ae297329d984352244b29d4c21799e1b","plan_job_ref":"Job Terraform Plan #5 at https://github.com/getsentry/security-cloud-functions-template/actions/runs/10620647076","plan_hash":"a00b0999dbdb838430f88f0fadf4fa3f5c367719b67672ad61628999da066be1","plan_text_format":"trunc","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 89 to add, 0 to change, 0 to destroy.</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_storage_bucket.staging_bucket will be created
  + resource "google_storage_bucket" "staging_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "jeffreyhung-test-cloud-function-staging"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.infrastructure.google_iam_workload_identity_pool.gha_terraform_checker_pool will be created
  + resource "google_iam_workload_identity_pool" "gha_terraform_checker_pool" {
      + description               = "Identity pool for Terraform Plan GHA"
      + display_name              = "GHA Terraform Checker Pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "jeffreyhung-test"
      + state                     = (known after apply)
      + workload_identity_pool_id = "**************************"
    }

  # module.infrastructure.google_iam_workload_identity_pool_provider.gha_terraform_checker_provider will be created
  + resource "google_iam_workload_identity_pool_provider" "gha_terraform_checker_provider" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.aud"        = "assertion.aud"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.repository"
        }
      + description                        = "OIDC identity pool provider for Terraform Plan GHA"
      + display_name                       = "GHA Terraform Checker Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "jeffreyhung-test"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "**************************"
      + workload_identity_pool_provider_id = "******************************"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.infrastructure.google_project_service.bigquery_googleapis_com will be created
  + resource "google_project_service" "bigquery_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "bigquery.googleapis.com"
    }

  # module.infrastructure.google_project_service.bigquerymigration_googleapis_com will be created
  + resource "google_project_service" "bigquerymigration_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "bigquerymigration.googleapis.com"
    }

  # module.infrastructure.google_project_service.bigquerystorage_googleapis_com will be created
  + resource "google_project_service" "bigquerystorage_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "bigquerystorage.googleapis.com"
    }

  # module.infrastructure.google_project_service.cloudapis_googleapis_com will be created
  + resource "google_project_service" "cloudapis_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "cloudapis.googleapis.com"
    }

  # module.infrastructure.google_project_service.cloudasset_googleapis_com will be created
  + resource "google_project_service" "cloudasset_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "cloudasset.googleapis.com"
    }

  # module.infrastructure.google_project_service.cloudbuild_googleapis_com will be created
  + resource "google_project_service" "cloudbuild_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "cloudbuild.googleapis.com"
    }

  # module.infrastructure.google_project_service.cloudfunctions_googleapis_com will be created
  + resource "google_project_service" "cloudfunctions_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "cloudfunctions.googleapis.com"
    }

  # module.infrastructure.google_project_service.cloudresourcemanager_googleapis_com will be created
  + resource "google_project_service" "cloudresourcemanager_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.infrastructure.google_project_service.cloudscheduler_googleapis_com will be created
  + resource "google_project_service" "cloudscheduler_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "cloudscheduler.googleapis.com"
    }

  # module.infrastructure.google_project_service.cloudtrace_googleapis_com will be created
  + resource "google_project_service" "cloudtrace_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "cloudtrace.googleapis.com"
    }

  # module.infrastructure.google_project_service.compute_googleapis_com will be created
  + resource "google_project_service" "compute_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "compute.googleapis.com"
    }

  # module.infrastructure.google_project_service.containerregistry_googleapis_com will be created
  + resource "google_project_service" "containerregistry_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "containerregistry.googleapis.com"
    }

  # module.infrastructure.google_project_service.datastore_googleapis_com will be created
  + resource "google_project_service" "datastore_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "datastore.googleapis.com"
    }

  # module.infrastructure.google_project_service.eventarc_googleapis_com will be created
  + resource "google_project_service" "eventarc_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "eventarc.googleapis.com"
    }

  # module.infrastructure.google_project_service.firebaserules_googleapis_com will be created
  + resource "google_project_service" "firebaserules_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "firebaserules.googleapis.com"
    }

  # module.infrastructure.google_project_service.firestore_googleapis_com will be created
  + resource "google_project_service" "firestore_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "firestore.googleapis.com"
    }

  # module.infrastructure.google_project_service.firestorekeyvisualizer_googleapis_com will be created
  + resource "google_project_service" "firestorekeyvisualizer_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "firestorekeyvisualizer.googleapis.com"
    }

  # module.infrastructure.google_project_service.iam_googleapis_com will be created
  + resource "google_project_service" "iam_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "iam.googleapis.com"
    }

  # module.infrastructure.google_project_service.iamcredentials_googleapis_com will be created
  + resource "google_project_service" "iamcredentials_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "iamcredentials.googleapis.com"
    }

  # module.infrastructure.google_project_service.logging_googleapis_com will be created
  + resource "google_project_service" "logging_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "logging.googleapis.com"
    }

  # module.infrastructure.google_project_service.monitoring_googleapis_com will be created
  + resource "google_project_service" "monitoring_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "monitoring.googleapis.com"
    }

  # module.infrastructure.google_project_service.oslogin_googleapis_com will be created
  + resource "google_project_service" "oslogin_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "oslogin.googleapis.com"
    }

  # module.infrastructure.google_project_service.project_service will be created
  + resource "google_project_service" "project_service" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "iap.googleapis.com"
    }

  # module.infrastructure.google_project_service.pubsub_googleapis_com will be created
  + resource "google_project_service" "pubsub_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "pubsub.googleapis.com"
    }

  # module.infrastructure.google_project_service.pubsublite_googleapis_com will be created
  + resource "google_project_service" "pubsublite_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "pubsublite.googleapis.com"
    }

  # module.infrastructure.google_project_service.run_googleapis_com will be created
  + resource "google_project_service" "run_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "run.googleapis.com"
    }

  # module.infrastructure.google_project_service.secretmanager_googleapis_com will be created
  + resource "google_project_service" "secretmanager_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "secretmanager.googleapis.com"
    }

  # module.infrastructure.google_project_service.servicemanagement_googleapis_com will be created
  + resource "google_project_service" "servicemanagement_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "servicemanagement.googleapis.com"
    }

  # module.infrastructure.google_project_service.serviceusage_googleapis_com will be created
  + resource "google_project_service" "serviceusage_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "serviceusage.googleapis.com"
    }

  # module.infrastructure.google_project_service.sql_component_googleapis_com will be created
  + resource "google_project_service" "sql_component_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "sql-component.googleapis.com"
    }

  # module.infrastructure.google_project_service.storage_api_googleapis_com will be created
  + resource "google_project_service" "storage_api_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "storage-api.googleapis.com"
    }

  # module.infrastructure.google_project_service.storage_component_googleapis_com will be created
  + resource "google_project_service" "storage_component_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "storage-component.googleapis.com"
    }

  # module.infrastructure.google_project_service.storage_googleapis_com will be created
  + resource "google_project_service" "storage_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "storage.googleapis.com"
    }

  # module.infrastructure.google_project_service.vpcaccess_googleapis_com will be created
  + resource "google_project_service" "vpcaccess_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "vpcaccess.googleapis.com"
    }

  # module.infrastructure.google_project_service.workflowexecutions_googleapis_com will be created
  + resource "google_project_service" "workflowexecutions_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "workflowexecutions.googleapis.com"
    }

  # module.infrastructure.google_project_service.workflows_googleapis_com will be created
  + resource "google_project_service" "workflows_googleapis_com" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "jeffreyhung-test"
      + service            = "workflows.googleapis.com"
    }

  # module.infrastructure.google_secret_manager_secret.secret["GH_APP_ID"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "jeffreyhung-test"
      + secret_id             = "*********"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.infrastructure.google_secret_manager_secret.secret["GH_APP_INSTALLATION_ID"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "jeffreyhung-test"
      + secret_id             = "**********************"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.infrastructure.google_secret_manager_secret.secret["GH_APP_PRI_KEY"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "jeffreyhung-test"
      + secret_id             = "**************"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.infrastructure.google_secret_manager_secret.secret["test_key_1"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "jeffreyhung-test"
      + secret_id             = "**********"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.infrastructure.google_secret_manager_secret.secret["test_key_2"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "jeffreyhung-test"
      + secret_id             = "**********"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.infrastructure.google_service_account.gha_cloud_functions_deployment will be created
  + resource "google_service_account" "gha_cloud_functions_deployment" {
      + account_id   = "******************************"
      + description  = "For use by Terraform and GitHub Actions to deploy cloud-functions"
      + disabled     = false
      + display_name = "gha-cloud-functions-deployment"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "jeffreyhung-test"
      + unique_id    = (known after apply)
    }

  # module.infrastructure.google_service_account_iam_member.gha_workload_identity_user will be created
  + resource "google_service_account_iam_member" "gha_workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1"].data.archive_file.source will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "source" {
      + excludes            = [
          + "terraform.yaml",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/example-gen1.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "functions/example-gen1"
      + type                = "zip"
    }

  # module.functions.module.cloud_function["example-gen1"].google_cloudfunctions_function.function will be created
  + resource "google_cloudfunctions_function" "function" {
      + available_memory_mb           = 128
      + build_service_account         = (known after apply)
      + description                   = "test function"
      + docker_registry               = (known after apply)
      + effective_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + entry_point                   = "main"
      + https_trigger_security_level  = (known after apply)
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = (known after apply)
      + name                          = "example-gen1"
      + project                       = "jeffreyhung-test"
      + region                        = "us-west1"
      + runtime                       = "python39"
      + service_account_email         = (known after apply)
      + source_archive_bucket         = "jeffreyhung-test-cloud-function-staging"
      + source_archive_object         = (known after apply)
      + status                        = (known after apply)
      + terraform_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + timeout                       = 60
      + trigger_http                  = true
      + version_id                    = (known after apply)
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1"].google_cloudfunctions_function_iam_member.involker will be created
  + resource "google_cloudfunctions_function_iam_member" "involker" {
      + cloud_function = "example-gen1"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = "jeffreyhung-test"
      + region         = "us-west1"
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.functions.module.cloud_function["example-gen1"].google_project_iam_member.function_sa_logwriter_iam will be created
  + resource "google_project_iam_member" "function_sa_logwriter_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "jeffreyhung-test"
      + role    = "roles/logging.logWriter"
    }

  # module.functions.module.cloud_function["example-gen1"].google_service_account.function_sa will be created
  + resource "google_service_account" "function_sa" {
      + account_id   = "***************"
      + disabled     = false
      + display_name = "Cloud Function Service Account for example-gen1"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "jeffreyhung-test"
      + unique_id    = (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1"].google_service_account_iam_member.deploy_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "deploy_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1"].google_service_account_iam_member.function_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "function_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1"].google_storage_bucket_object.zip will be created
  + resource "google_storage_bucket_object" "zip" {
      + bucket         = "jeffreyhung-test-cloud-function-staging"
      + content        = (sensitive value)
      + content_type   = "application/zip"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/tmp/example-gen1.zip"
      + storage_class  = (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1-cron"].data.archive_file.source will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "source" {
      + excludes            = [
          + "terraform.yaml",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/example-gen1-cron.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "functions/example-gen1-cron"
      + type                = "zip"
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_cloudfunctions_function.function will be created
  + resource "google_cloudfunctions_function" "function" {
      + available_memory_mb           = 128
      + build_service_account         = (known after apply)
      + description                   = "test function 2"
      + docker_registry               = (known after apply)
      + effective_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + entry_point                   = "main"
      + environment_variables         = {
          + "env_1" = "123"
          + "env_2" = "345"
        }
      + https_trigger_security_level  = (known after apply)
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = (known after apply)
      + name                          = "example-gen1-cron"
      + project                       = "jeffreyhung-test"
      + region                        = "us-west1"
      + runtime                       = "python311"
      + service_account_email         = (known after apply)
      + source_archive_bucket         = "jeffreyhung-test-cloud-function-staging"
      + source_archive_object         = (known after apply)
      + status                        = (known after apply)
      + terraform_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + timeout                       = 60
      + trigger_http                  = true
      + version_id                    = (known after apply)
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger (known after apply)

      + secret_environment_variables {
          + key        = "test_key_1"
          + project_id = (known after apply)
          + secret     = "test_key_1"
          + version    = "latest"
        }
      + secret_environment_variables {
          + key        = "test_key_2"
          + project_id = (known after apply)
          + secret     = "test_key_2"
          + version    = "latest"
        }
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_cloudfunctions_function_iam_member.involker will be created
  + resource "google_cloudfunctions_function_iam_member" "involker" {
      + cloud_function = "example-gen1-cron"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = "jeffreyhung-test"
      + region         = "us-west1"
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_project_iam_member.function_sa_logwriter_iam will be created
  + resource "google_project_iam_member" "function_sa_logwriter_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "jeffreyhung-test"
      + role    = "roles/logging.logWriter"
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_secret_manager_secret_iam_member.secret_iam["test_key_1"] will be created
  + resource "google_secret_manager_secret_iam_member" "secret_iam" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "**********"
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_secret_manager_secret_iam_member.secret_iam["test_key_2"] will be created
  + resource "google_secret_manager_secret_iam_member" "secret_iam" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "**********"
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_service_account.function_sa will be created
  + resource "google_service_account" "function_sa" {
      + account_id   = "********************"
      + disabled     = false
      + display_name = "Cloud Function Service Account for example-gen1-cron"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "jeffreyhung-test"
      + unique_id    = (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_service_account_iam_member.deploy_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "deploy_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_service_account_iam_member.function_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "function_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_storage_bucket_object.zip will be created
  + resource "google_storage_bucket_object" "zip" {
      + bucket         = "jeffreyhung-test-cloud-function-staging"
      + content        = (sensitive value)
      + content_type   = "application/zip"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/tmp/example-gen1-cron.zip"
      + storage_class  = (known after apply)
    }

  # module.functions.module.cloud_function["get-gh-app-token"].data.archive_file.source will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "source" {
      + excludes            = [
          + "terraform.yaml",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/get-gh-app-token.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "functions/get-gh-app-token"
      + type                = "zip"
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_cloudfunctions_function.function will be created
  + resource "google_cloudfunctions_function" "function" {
      + available_memory_mb           = 128
      + build_service_account         = (known after apply)
      + description                   = "example for using github app in cloud function"
      + docker_registry               = (known after apply)
      + effective_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + entry_point                   = "main"
      + https_trigger_security_level  = (known after apply)
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = (known after apply)
      + name                          = "get-gh-app-token"
      + project                       = "jeffreyhung-test"
      + region                        = "us-west1"
      + runtime                       = "python311"
      + service_account_email         = (known after apply)
      + source_archive_bucket         = "jeffreyhung-test-cloud-function-staging"
      + source_archive_object         = (known after apply)
      + status                        = (known after apply)
      + terraform_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + timeout                       = 60
      + trigger_http                  = true
      + version_id                    = (known after apply)
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger (known after apply)

      + secret_environment_variables {
          + key        = "GH_APP_ID"
          + project_id = (known after apply)
          + secret     = "GH_APP_ID"
          + version    = "latest"
        }
      + secret_environment_variables {
          + key        = "GH_APP_INSTALLATION_ID"
          + project_id = (known after apply)
          + secret     = "GH_APP_INSTALLATION_ID"
          + version    = "latest"
        }
      + secret_environment_variables {
          + key        = "GH_APP_PRI_KEY"
          + project_id = (known after apply)
          + secret     = "GH_APP_PRI_KEY"
          + version    = "latest"
        }
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_cloudfunctions_function_iam_member.involker will be created
  + resource "google_cloudfunctions_function_iam_member" "involker" {
      + cloud_function = "get-gh-app-token"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = "jeffreyhung-test"
      + region         = "us-west1"
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_project_iam_member.function_sa_logwriter_iam will be created
  + resource "google_project_iam_member" "function_sa_logwriter_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "jeffreyhung-test"
      + role    = "roles/logging.logWriter"
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_secret_manager_secret_iam_member.secret_iam["GH_APP_ID"] will be created
  + resource "google_secret_manager_secret_iam_member" "secret_iam" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "*********"
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_secret_manager_secret_iam_member.secret_iam["GH_APP_INSTALLATION_ID"] will be created
  + resource "google_secret_manager_secret_iam_member" "secret_iam" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "**********************"
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_secret_manager_secret_iam_member.secret_iam["GH_APP_PRI_KEY"] will be created
  + resource "google_secret_manager_secret_iam_member" "secret_iam" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "**************"
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_service_account.function_sa will be created
  + resource "google_service_account" "function_sa" {
      + account_id   = "*******************"
      + disabled     = false
      + display_name = "Cloud Function Service Account for get-gh-app-token"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "jeffreyhung-test"
      + unique_id    = (known after apply)
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_service_account_iam_member.deploy_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "deploy_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_service_account_iam_member.function_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "function_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_storage_bucket_object.zip will be created
  + resource "google_storage_bucket_object" "zip" {
      + bucket         = "jeffreyhung-test-cloud-function-staging"
      + content        = (sensitive value)
      + content_type   = "application/zip"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/tmp/get-gh-app-token.zip"
      + storage_class  = (known after apply)
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].data.archive_file.source will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "source" {
      + excludes            = [
          + "terraform.yaml",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/example-gen2-cron.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "functions/example-gen2-cron"
      + type                = "zip"
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_cloudfunctions2_function.function will be created
  + resource "google_cloudfunctions2_function" "function" {
      + description      = "gen2 cloud function example"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + environment      = (known after apply)
      + id               = (known after apply)
      + location         = "us-west1"
      + name             = "example-gen2-cron"
      + project          = "jeffreyhung-test"
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
      + url              = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = "projects/jeffreyhung-test/locations/us-west1/repositories/gcf-artifacts"
          + entry_point           = "main"
          + environment_variables = {
              + "ENV_1" = "123"
              + "ENV_2" = "345"
            }
          + runtime               = "python311"
          + service_account       = (known after apply)

          + automatic_update_policy (known after apply)

          + source {
              + storage_source {
                  + bucket     = "jeffreyhung-test-cloud-function-staging"
                  + generation = (known after apply)
                  + object     = (known after apply)
                }
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = "128Mi"
          + environment_variables            = (known after apply)
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = (known after apply)
          + max_instance_request_concurrency = (known after apply)
          + service                          = (known after apply)
          + service_account_email            = (known after apply)
          + timeout_seconds                  = 120
          + uri                              = (known after apply)

          + secret_environment_variables {
              + key        = "test_key_1"
              + project_id = "****************"
              + secret     = "test_key_1"
              + version    = "latest"
            }
        }
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_cloudfunctions2_function_iam_member.invoker_allusers will be created
  + resource "google_cloudfunctions2_function_iam_member" "invoker_allusers" {
      + cloud_function = "example-gen2-cron"
      + etag           = (known after apply)
      + id             = (known after apply)
      + location       = "us-west1"
      + member         = "allUsers"
      + project        = "jeffreyhung-test"
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_project_iam_member.function_sa_logwriter_iam will be created
  + resource "google_project_iam_member" "function_sa_logwriter_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "jeffreyhung-test"
      + role    = "roles/logging.logWriter"
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_secret_manager_secret_iam_member.secret_iam["test_key_1"] will be created
  + resource "google_secret_manager_secret_iam_member" "secret_iam" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "**********"
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_service_account.function_sa will be created
  + resource "google_service_account" "function_sa" {
      + account_id   = "********************"
      + disabled     = false
      + display_name = "Cloud Function Service Account for example-gen2-cron"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "jeffreyhung-test"
      + unique_id    = (known after apply)
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_service_account_iam_member.deploy_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "deploy_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_service_account_iam_member.function_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "function_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_storage_bucket_object.zip will be created
  + resource "google_storage_bucket_object" "zip" {
      + bucket         = "jeffreyhung-test-cloud-function-staging"
      + content        = (sensitive value)
      + content_type   = "application/zip"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/tmp/example-gen2-cron.zip"
      + storage_class  = (known after apply)
    }

  # module.functions.module.cronjob["example-gen1-cron"].google_cloud_scheduler_job.example_cronjob will be created
  + resource "google_cloud_scheduler_job" "example_cronjob" {
      + attempt_deadline = "320s"
      + description      = "test function 2"
      + id               = (known after apply)
      + name             = "example-gen1-cron"
      + paused           = (known after apply)
      + project          = "jeffreyhung-test"
      + region           = "us-west1"
      + schedule         = "0 * * * *"
      + state            = (known after apply)
      + time_zone        = "America/New_York"

      + http_target {
          + http_method = "GET"
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Terraform Plan #5](https://github.com/getsentry/security-cloud-functions-template/actions/runs/10620647076)